-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- 主機: localhost
-- 產生時間： 2017 年 06 月 08 日 15:52
-- 伺服器版本: 10.1.21-MariaDB
-- PHP 版本： 5.6.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `TravelByMyself`
--

-- --------------------------------------------------------

--
-- 資料表結構 `member`
--

CREATE TABLE `member` (
  `id` int(11) NOT NULL,
  `username` varchar(200) NOT NULL,
  `password` varchar(200) NOT NULL,
  `email` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `member`
--

INSERT INTO `member` (`id`, `username`, `password`, `email`) VALUES
(7, 'create', 'ccc', 'create@gmail.com'),
(9, 'test', 'kkk', 'ppp.gmail.com'),
(10, 'FBTest', 'FBTest', ''),
(11, '1615632371813455', '1615632371813455', ''),
(12, 'demo1', 'ccc', 'demo1@gmail.com'),
(13, 'demo2', 'ddd', 'demo2@gmail.com');

-- --------------------------------------------------------

--
-- 資料表結構 `pocketspot`
--

CREATE TABLE `pocketspot` (
  `id` int(11) NOT NULL,
  `spotName` varchar(200) NOT NULL,
  `ownerUser` varchar(200) NOT NULL,
  `spotCountry` varchar(200) NOT NULL,
  `placeID` varchar(300) NOT NULL,
  `latitude` double NOT NULL,
  `longitude` double NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

--
-- 資料表的匯出資料 `pocketspot`
--

INSERT INTO `pocketspot` (`id`, `spotName`, `ownerUser`, `spotCountry`, `placeID`, `latitude`, `longitude`) VALUES
(5, '羅浮宮', 'create', '法國', '1234', 0, 0),
(12, 'Tokyo', 'create', '日本', '9012', 0, 0),
(14, '松山機場', '1615632371813455', '台灣', '', 0, 0),
(18, '故宮博物院', '1615632371813455', '台灣', '', 0, 0),
(19, '西門町', '1615632371813455', '台灣', '', 0, 0),
(25, '臺北市立圖書館北投分館-綠建築示範基地', 'create', '台灣', 'ChIJC1DM2kSuQjQRHQpu_eh59Mg', 25.1365247, 121.5063771),
(26, '紅毛城(真理大學)', 'create', '台灣', 'ChIJQegHA1ClQjQR80lB63fojRM', 25.174179, 121.43441),
(27, '清水寺', '1615632371813455', '日本', '', 0, 0),
(28, '金閣寺', '1615632371813455', '日本', '', 0, 0);

-- --------------------------------------------------------

--
-- 資料表結構 `pockettrip`
--

CREATE TABLE `pockettrip` (
  `id` int(11) NOT NULL,
  `tripName` varchar(200) NOT NULL,
  `tripDays` int(11) NOT NULL,
  `ownerUser` varchar(200) NOT NULL,
  `tripCountry` varchar(200) NOT NULL,
  `coverImg` varchar(300) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

--
-- 資料表的匯出資料 `pockettrip`
--

INSERT INTO `pockettrip` (`id`, `tripName`, `tripDays`, `ownerUser`, `tripCountry`, `coverImg`) VALUES
(7, '日本五日遊', 5, 'create', '日本', 'create_日本五日遊_1496043112_pocketTripCover.jpeg'),
(12, '老外玩台北', 3, 'create', '台灣', 'create_老外玩台北_1496669681_tripCover.jpeg'),
(13, '日本五日遊', 5, '1615632371813455', '日本', '1615632371813455_日本五日遊_1496833286_tripCover.jpeg'),
(14, '老外玩台北', 3, '1615632371813455', '台灣', '1615632371813455_老外玩台北_1496842926_tripCover.jpeg'),
(16, '測試二', 1, 'create', '台灣', 'create_測試二_1496854402_tripCover.jpeg'),
(17, '測試三', 1, 'create', '台灣', 'create_測試三_1496854912_tripCover.jpeg'),
(18, '測試四', 1, 'create', '台灣', 'create_測試四_1496855118_tripCover.jpeg'),
(19, '測試五', 1, 'create', '台灣', 'create_測試五_1496855304_tripCover.jpeg'),
(20, '測試六', 1, 'create', '台灣', 'create_測試六_1496857316_tripCover.jpeg'),
(21, 'demo', 3, '1615632371813455', '日本', '1615632371813455_demo_1496901530_tripCover.jpeg');

-- --------------------------------------------------------

--
-- 資料表結構 `pockettripspot`
--

CREATE TABLE `pockettripspot` (
  `id` int(11) NOT NULL,
  `tripName` varchar(300) NOT NULL,
  `spotName` varchar(300) NOT NULL,
  `nDay` int(11) NOT NULL,
  `nth` int(11) NOT NULL,
  `trafficToNext` varchar(300) NOT NULL,
  `ownerUser` varchar(300) NOT NULL,
  `placeID` varchar(300) NOT NULL,
  `trafficTitle` varchar(200) NOT NULL,
  `latitude` double NOT NULL,
  `longitude` double NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

--
-- 資料表的匯出資料 `pockettripspot`
--

INSERT INTO `pockettripspot` (`id`, `tripName`, `spotName`, `nDay`, `nth`, `trafficToNext`, `ownerUser`, `placeID`, `trafficTitle`, `latitude`, `longitude`) VALUES
(9, '日本五日遊', '天龍寺', 2, 2, '', 'create', '', '', 0, 0),
(10, '日本五日遊', '金閣寺', 2, 1, '十號公車轉三號公車，下車向西二十公尺後左轉，五十公尺後右轉，換地鐵三號線至天龍人站，向東行五十公尺後右轉，直行二十公尺', 'create', '', '', 0, 0),
(11, '日本五日遊', '平等院', 1, 2, '十號公車轉三號公車，下車向西二十公尺後左轉，五十公尺後右轉，換五號公車乘坐到金閣寺站，下車向東行三十公尺', 'create', '', '', 0, 0),
(12, '日本五日遊', '清水寺', 1, 1, '十號公車轉三號公車，下車向西二十公尺後左轉，五十公尺後右轉', 'create', '', '', 0, 0),
(40, '老外玩台北', '松山機場', 1, 0, '1. 往西\n\n2. 靠右，繼續朝敦化北路前進\n\n3. 靠左行駛，進入敦化北路\n\n4. 靠左以繼續行駛敦化北路\n\n5. 靠右繼續走敦化南路一段\n\n6. 於市民大道四段向右轉\n\n7. 接著走市民大道三段\n\n8. 接著走市民大道二段\n\n9. 靠左，繼續朝市民大道一段前進\n\n10. 走市民大道一段\n\n11. 靠左行駛\n\n12. 靠左行駛，進入鄭州路\n\n13. 於延平北路一段向左轉\n\n14. 向右轉，朝忠孝西路二段縱貫公路台1線台3線前進\n\n15. 於忠孝西路二段縱貫公路台1線台3線靠右行駛\n\n16. 於中華路一段台3線向左轉\n\n17. 在第 2 個十字路口向右轉，走開封街二段\n\n18. 於漢中街向左轉', 'create', '', '', 0, 0),
(41, '老外玩台北', '西門町', 1, 1, '1. 往北走漢中街朝西寧南路71巷前進\n\n2. 於開封街二段向左轉\n\n3. 於環河南路一段向右轉\n\n4. 接著走環河北路一段\n\n5. 向右轉上市民大道匝道，到新生南（北）路永吉路\n\n6. 接著走台北市東西向快速道路市民大道市民大道高架道路\n\n7. 靠右以繼續行駛台北市東西向快速道路市民大道市民大道高架道路\n\n8. 靠左下交流道後，走永吉路\n\n9. 繼續直行，並繼續走永吉路\n\n10. 於松山路向左轉\n\n11. 繼續直行走八德路四段\n\n12. 於饒河街向左轉\n註：16:00 – 00:00 禁止轉彎\n註：目的地在右邊', 'create', '', '', 0, 0),
(42, '老外玩台北', '饒河街觀光夜市', 1, 2, '路線計算錯誤', 'create', '', '', 0, 0),
(43, '老外玩台北', '陽明山國家公園', 3, 0, '路線計算錯誤', 'create', '', '', 0, 0),
(44, '老外玩台北', '淡水老街', 2, 1, '路線計算錯誤', 'create', '', '', 0, 0),
(45, '老外玩台北', '故宮博物院', 2, 0, '1. 往南走漢中街朝漢口街二段前進\n\n2. 在第 1 個十字路口向左轉，走漢口街二段\n\n3. 於中華路一段向左轉\n\n4. 於忠孝西路二段縱貫公路台1線台3線向右轉\n註：繼續開在縱貫公路台1線台3線上\n\n5. 繼續直行走忠孝西路一段縱貫公路台1線台3線\n\n6. 靠左行駛，進入忠孝西路一段\n\n7. 於忠孝東路一段台5線向左轉\n\n8. 繼續直行，並繼續走忠孝東路一段台5線\n註：繼續開在台5線上\n\n9. 於八德路一段向左轉\n\n10. 於金山北路向左轉\n\n11. 靠左上匝道接上長安東路民生東路士林大直\n\n12. 走新生高架道路\n\n13. 走中山北路四段台2甲線\n\n14. 繼續直行，並繼續走中山北路四段台', 'create', '', '', 0, 0),
(46, '日本五日遊', '天龍寺', 2, 1, '', '1615632371813455', '', '', 0, 0),
(47, '日本五日遊', '清水寺', 1, 1, '十號公車轉三號公車，下車向西二十公尺後左轉，五十公尺後右轉', '1615632371813455', '', '', 0, 0),
(48, '日本五日遊', '平等院', 2, 2, '十號公車轉三號公車，下車向西二十公尺後左轉，五十公尺後右轉，換五號公車乘坐到金閣寺站，下車向東行三十公尺', '1615632371813455', '', '', 0, 0),
(49, '日本五日遊', '金閣寺', 1, 2, '十號公車轉三號公車，下車向西二十公尺後左轉，五十公尺後右轉，換地鐵三號線至天龍人站，向東行五十公尺後右轉，直行二十公尺', '1615632371813455', '', '', 0, 0),
(50, '老外玩台北', '西門町', 1, 1, '1. 往北走漢中街朝西寧南路71巷前進\n\n2. 於開封街二段向左轉\n\n3. 於環河南路一段向右轉\n\n4. 接著走環河北路一段\n\n5. 向右轉上市民大道匝道，到新生南（北）路永吉路\n\n6. 接著走台北市東西向快速道路市民大道市民大道高架道路\n\n7. 靠右以繼續行駛台北市東西向快速道路市民大道市民大道高架道路\n\n8. 靠左下交流道後，走永吉路\n\n9. 繼續直行，並繼續走永吉路\n\n10. 於松山路向左轉\n\n11. 繼續直行走八德路四段\n\n12. 於饒河街向左轉\n註：16:00 – 00:00 禁止轉彎\n註：目的地在右邊', '1615632371813455', '', '走路, 18 分', 0, 0),
(51, '老外玩台北', '松山機場', 1, 0, '1. 往西\n\n2. 靠右，繼續朝敦化北路前進\n\n3. 靠左行駛，進入敦化北路\n\n4. 靠左以繼續行駛敦化北路\n\n5. 靠右繼續走敦化南路一段\n\n6. 於市民大道四段向右轉\n\n7. 接著走市民大道三段\n\n8. 接著走市民大道二段\n\n9. 靠左，繼續朝市民大道一段前進\n\n10. 走市民大道一段\n\n11. 靠左行駛\n\n12. 靠左行駛，進入鄭州路\n\n13. 於延平北路一段向左轉\n\n14. 向右轉，朝忠孝西路二段縱貫公路台1線台3線前進\n\n15. 於忠孝西路二段縱貫公路台1線台3線靠右行駛\n\n16. 於中華路一段台3線向左轉\n\n17. 在第 2 個十字路口向右轉，走開封街二段\n\n18. 於漢中街向左轉', '1615632371813455', '', '走路, 19 分', 0, 0),
(52, '老外玩台北', '饒河街觀光夜市', 1, 2, '路線計算錯誤', '1615632371813455', '', '時間計算error唷', 0, 0),
(53, '老外玩台北', '故宮博物院', 2, 0, '1. 往南走漢中街朝漢口街二段前進\n\n2. 在第 1 個十字路口向左轉，走漢口街二段\n\n3. 於中華路一段向左轉\n\n4. 於忠孝西路二段縱貫公路台1線台3線向右轉\n註：繼續開在縱貫公路台1線台3線上\n\n5. 繼續直行走忠孝西路一段縱貫公路台1線台3線\n\n6. 靠左行駛，進入忠孝西路一段\n\n7. 於忠孝東路一段台5線向左轉\n\n8. 繼續直行，並繼續走忠孝東路一段台5線\n註：繼續開在台5線上\n\n9. 於八德路一段向左轉\n\n10. 於金山北路向左轉\n\n11. 靠左上匝道接上長安東路民生東路士林大直\n\n12. 走新生高架道路\n\n13. 走中山北路四段台2甲線\n\n14. 繼續直行，並繼續走中山北路四段台', '1615632371813455', '', '走路, 25 分', 0, 0),
(54, '老外玩台北', '淡水老街', 2, 1, '路線計算錯誤', '1615632371813455', '', '時間計算error唷', 0, 0),
(55, '老外玩台北', '陽明山國家公園', 3, 0, '路線計算錯誤', '1615632371813455', '', '時間計算error唷', 0, 0),
(56, '測試二', '新北市中和區中和國民小學', 1, 0, '1. 往東走廣州街朝廣州街209巷前進\n\n2. 於昆明街向左轉\n\n3. 繼續直行，並繼續走昆明街\n\n4. 繼續直行，並繼續走昆明街\n\n5. 於內江街向右轉', 'create', '', '開車, 6 分', 25.000035, 121.501401),
(57, '測試二', '龍山寺', 1, 1, '1. 往西北走中和路北99鄉道朝廣福路前進\n\n2. 於中山路二段向左轉\n\n3. 於景平路向右轉\n\n4. 接著走華中橋\n\n5. 靠左行駛，進入萬大路\n\n6. 接著走康定路\n\n7. 於廣州街向左轉\n註：目的地在右邊', 'create', '', '開車, 16 分', 25.0371623, 121.4999007),
(58, '測試二', '西門紅樓', 1, 2, '1. 往東走內江街朝漢中街前進\n\n2. 於漢中街向右轉\n\n3. 於長沙街二段向左轉\n\n4. 於中華路一段台3線向左轉\n\n5. 靠左以繼續行駛中華路一段台3線\n\n6. 於忠孝西路二段縱貫公路台1線台3線向右轉\n註：繼續開在縱貫公路台1線台3線上\n\n7. 繼續直行走忠孝西路一段縱貫公路台1線台3線\n\n8. 靠左行駛，進入忠孝西路一段\n\n9. 於忠孝東路一段台5線向左轉\n\n10. 繼續直行，並繼續走忠孝東路一段台5線\n註：繼續開在台5線上\n\n11. 於八德路一段向左轉\n\n12. 於金山北路向左轉\n\n13. 靠左上匝道接上長安東路民生東路士林大直\n\n14. 走新生高架道路\n\n15. 走中山北路四段台2', 'create', '', '開車, 26 分', 25.0420139, 121.5068592),
(59, '測試二', '故宮博物院', 1, 3, '1. 往東北走至善路二段\n\n2. 迴轉\n\n3. 繼續直行走至善路一段\n\n4. 於福林路台2甲線向左轉\n\n5. 於中正路靠右行駛\n\n6. 於美德街向右轉\n\n7. 於前街向左轉\n\n8. 於士林橋文林路向右轉\n註：繼續開在文林路上\n\n9. 接著走文林北路\n\n10. 接著走承德路七段台2乙線\n註：繼續開在台2乙線上\n\n11. 靠左繼續走大度路一段台2乙線\n註：繼續開在台2乙線上\n\n12. 靠左繼續走北部濱海公路民權路台2乙線\n\n13. 靠左繼續走北部濱海公路民權路民權路(淡水市區)淡金公路台2乙線台2線\n註：繼續開在北部濱海公路淡金公路台2乙線台2線上\n\n14. 於台2乙線靠右行駛\n\n15. 請於建設', 'create', '', '開車, 44 分', 25.099576, 121.549468),
(60, '測試二', '淡水老街', 1, 4, '路線計算錯誤', 'create', '', 'routeCalculate error', 25.1710272, 121.4385461),
(61, '測試三', '新北市中和區中和國民小學', 1, 0, '1. 往東北走市民大道五段朝東寧路前進\n\n2. 於東寧路處迴轉\n\n3. 靠左上匝道接上建國南路重慶北路環河北路\n\n4. 走台北市東西向快速道路市民大道市民大道高架道路\n\n5. 靠右以繼續行駛台北市東西向快速道路市民大道市民大道高架道路\n\n6. 靠左，循著環河北路一段的路標走\n\n7. 於環河北路一段向右轉\n\n8. 走環河南北快速道路\n\n9. 靠左繼續走環河北路三段環河南北快速道路\n\n10. 接著走延平北路六段\n\n11. 靠左繼續走延平北路七段\n\n12. 接著走洲美快速道路洲美快速道路(洲美快速道路 承德路北投 淡水)\n\n13. 靠左以繼續行駛洲美快速道路洲美快速道路(洲美快速道路 承德路北投 淡', 'create', 'Optional(\"ChIJxfm16tepQjQRiGuqC_WG578\")', '開車, 1 小時 5 分', 25.000035, 121.501401),
(62, '測試三', '臺北車站', 1, 1, '1. 往西北走中和路北99鄉道朝廣福路前進\n\n2. 於中山路二段向左轉\n\n3. 於景平路向右轉\n\n4. 接著走華中橋\n\n5. 靠左行駛，進入萬大路\n\n6. 於艋舺大道向右轉\n\n7. 繼續直行，並繼續走艋舺大道\n\n8. 接著走中華路二段內山公路台3線\n註：繼續開在台3線上\n\n9. 靠左繼續走中華路一段台3線\n\n10. 於忠孝西路二段縱貫公路台1線台3線向右轉\n註：繼續開在縱貫公路台1線台3線上\n\n11. 繼續直行走忠孝西路一段縱貫公路台1線台3線\n\n12. 於館前路口向左轉\n\n13. 於北平西路向右轉\n\n14. 於承德路一段向左轉\n註：目的地在右邊', 'create', 'Optional(\"ChIJCZEzfnKpQjQRy75KOs4xSsM\")', '開車, 20 分', 25.0477387, 121.5170396),
(63, '測試三', '松山文創園區', 1, 2, '1. 往南走忠孝東路四段553巷朝忠孝東路四段553巷16弄前進\n\n2. 於忠孝東路四段台5線向右轉\n\n3. 於光復南路向右轉\n\n4. 於市民大道五段向右轉\n\n5. 靠右以繼續行駛市民大道五段\n註：目的地在右邊', 'create', 'Optional(\"ChIJO0vOI7-rQjQR3Pl9_4cPK8g\")', '開車, 5 分', 25.0436921, 121.5606419),
(64, '測試三', '京華城', 1, 3, '1. 往北走承德路一段\n\n2. 向左轉，朝重慶北路一段前進\n\n3. 靠右，繼續朝重慶北路一段前進\n\n4. 於重慶北路一段向右轉\n\n5. 於鄭州路向右轉\n\n6. 靠左上匝道，走台北市東西向快速道路市民大道市民大道高架道路\n\n7. 靠右以繼續行駛台北市東西向快速道路市民大道市民大道高架道路\n\n8. 靠左行，於光復南路出口下交流道\n\n9. 分岔路口靠左，沿著市民大道四段的路標走\n\n10. 於光復南路向右轉\n\n11. 於忠孝東路四段台5線向左轉\n\n12. 於忠孝東路四段553巷向左轉', 'create', 'Optional(\"ChIJez13M76rQjQRW5WvII1vuNU\")', '開車, 12 分', 25.0469893, 121.5626188),
(65, '測試三', '白沙灣海水浴場', 1, 4, '路線計算錯誤', 'create', 'Optional(\"ChIJSRyoNoy2QjQRLlevPD7OYKc\")', 'routeCalculate error', 25.2843145, 121.5172014),
(66, '測試四', '新北市中和區中和國民小學', 1, 0, '1. 往西北走中和路北99鄉道朝廣福路前進\n\n2. 於中山路二段向左轉\n\n3. 於景平路向右轉\n\n4. 接著走華中橋\n\n5. 靠左行駛，進入萬大路\n\n6. 於長泰街向左轉\n\n7. 於東園街向左轉\n\n8. 在第 1 個十字路口向右轉，走萬大路\n\n9. 向右轉，繼續沿萬大路前進\n\n10. 向右轉，朝環河南北快速道路環河快速道路前進\n\n11. 走環河南北快速道路環河快速道路\n\n12. 靠左繼續走環河南北快速道路\n\n13. 靠左繼續走環河北路三段環河南北快速道路\n\n14. 接著走延平北路六段\n\n15. 靠左繼續走延平北路七段\n\n16. 接著走洲美快速道路洲美快速道路(洲美快速道路 承德路北投 淡水)\n', 'create', 'Optional(\"ChIJxfm16tepQjQRiGuqC_WG578\")', '開車, 36 分', 25.000035, 121.501401),
(67, '測試四', '臺北市立圖書館北投分館-綠建築示範基地', 1, 1, '1. 往西走光明路朝溫泉路65巷前進\n\n2. 向左轉，繼續沿光明路前進\n\n3. 繼續直行，並繼續走光明路\n\n4. 於中央南路一段向左轉\n\n5. 繼續直行，並繼續走中央南路一段\n\n6. 向右轉，繼續沿中央南路一段前進\n\n7. 向右轉，繼續沿中央南路一段前進\n\n8. 於北投路一段向左轉\n\n9. 於中央南路二段向右轉\n\n10. 於大度路一段台2乙線向右轉\n\n11. 靠左以繼續行駛大度路一段台2乙線\n註：繼續開在台2乙線上\n\n12. 靠左繼續走北部濱海公路民權路台2乙線\n\n13. 靠左繼續走北部濱海公路民權路民權路(淡水市區)淡金公路台2乙線台2線\n註：繼續開在北部濱海公路淡金公路台2乙線台2線上\n\n', 'create', 'Optional(\"ChIJC1DM2kSuQjQRHQpu_eh59Mg\")', '開車, 32 分', 25.1365247, 121.5063771),
(68, '測試四', '白沙灣海水浴場', 1, 3, '路線計算錯誤', 'create', 'Optional(\"ChIJSRyoNoy2QjQRLlevPD7OYKc\")', 'routeCalculate error', 25.2843145, 121.5172014),
(69, '測試四', '紅毛城(真理大學)', 1, 2, '1. 往西北走中正路台2乙線朝真理街前進\n\n2. 於真理街處迴轉\n註：繼續開在台2乙線上\n\n3. 於中山路101縣道向左轉\n註：繼續開在101縣道上\n\n4. 繼續直行走中山北路一段北1鄉道\n註：繼續開在北1鄉道上\n\n5. 靠左行駛，進入北部濱海公路淡金公路淡金路三段台2線\n註：繼續開在北部濱海公路淡金公路台2線上\n\n6. 繼續直行走北海路一段北部濱海公路淡金公路淡金路一段台2線\n\n7. 繼續直行走北海路二段北部濱海公路淡金公路台2線\n註：繼續開在北部濱海公路淡金公路台2線上\n\n8. 向左轉', 'create', 'Optional(\"ChIJQegHA1ClQjQR80lB63fojRM\")', '開車, 37 分', 25.174179, 121.43441),
(70, '測試五', '新北市中和區中和國民小學', 1, 0, '1. 往西走光明路朝溫泉路65巷前進\n\n2. 向左轉，繼續沿光明路前進\n\n3. 繼續直行，並繼續走光明路\n\n4. 於中央南路一段向左轉\n\n5. 繼續直行，並繼續走中央南路一段\n\n6. 向右轉，繼續沿中央南路一段前進\n\n7. 向右轉，繼續沿中央南路一段前進\n\n8. 於北投路一段向左轉\n\n9. 於中央南路二段向右轉\n\n10. 於大度路一段台2乙線向右轉\n\n11. 靠左以繼續行駛大度路一段台2乙線\n註：繼續開在台2乙線上\n\n12. 靠左繼續走北部濱海公路民權路台2乙線\n\n13. 靠左繼續走北部濱海公路民權路民權路(淡水市區)淡金公路台2乙線台2線\n註：繼續開在北部濱海公路淡金公路台2乙線台2線上\n\n', 'create', 'ChIJxfm16tepQjQRiGuqC_WG578', '開車, 32 分', 25.000035, 121.501401),
(71, '測試五', '臺北車站', 1, 1, '1. 往西北走中和路北99鄉道朝廣福路前進\n\n2. 於中山路二段向左轉\n\n3. 於景平路向右轉\n\n4. 接著走華中橋\n\n5. 靠左行駛，進入萬大路\n\n6. 於艋舺大道向右轉\n\n7. 繼續直行，並繼續走艋舺大道\n\n8. 接著走中華路二段內山公路台3線\n註：繼續開在台3線上\n\n9. 靠左繼續走中華路一段台3線\n\n10. 於忠孝西路二段縱貫公路台1線台3線向右轉\n註：繼續開在縱貫公路台1線台3線上\n\n11. 繼續直行走忠孝西路一段縱貫公路台1線台3線\n\n12. 於館前路口向左轉\n\n13. 於北平西路向右轉\n\n14. 於承德路一段向左轉\n註：目的地在右邊', 'create', 'ChIJCZEzfnKpQjQRy75KOs4xSsM', '開車, 20 分', 25.0477387, 121.5170396),
(72, '測試五', '臺北市立圖書館北投分館-綠建築示範基地', 1, 2, '1. 往北走承德路一段\n\n2. 於鄭州路向左轉\n\n3. 於環河北路一段向右轉\n\n4. 走環河南北快速道路\n\n5. 靠左繼續走環河北路三段環河南北快速道路\n\n6. 接著走延平北路六段\n\n7. 靠左繼續走延平北路七段\n\n8. 接著走洲美快速道路洲美快速道路(洲美快速道路 承德路北投 淡水)\n\n9. 下交流道，走大業路，朝北投前進\n註：07:00 – 09:00 部分封閉\n\n10. 繼續直行，並繼續走大業路\n\n11. 繼續直行，並繼續走大業路\n\n12. 於光明路向右轉\n\n13. 向左轉，繼續沿光明路前進\n註：目的地在左邊', 'create', 'ChIJC1DM2kSuQjQRHQpu_eh59Mg', '開車, 25 分', 25.1365247, 121.5063771),
(73, '測試五', '紅毛城(真理大學)', 1, 3, '路線計算錯誤', 'create', 'ChIJQegHA1ClQjQR80lB63fojRM', 'routeCalculate error', 25.174179, 121.43441),
(74, '測試六', '新北市中和區中和國民小學', 1, 0, '1. 往西走光明路朝溫泉路65巷前進\n\n2. 向左轉，繼續沿光明路前進\n\n3. 繼續直行，並繼續走光明路\n\n4. 於中央南路一段向左轉\n\n5. 繼續直行，並繼續走中央南路一段\n\n6. 向右轉，繼續沿中央南路一段前進\n\n7. 向右轉，繼續沿中央南路一段前進\n\n8. 於北投路一段向左轉\n\n9. 於中央南路二段向右轉\n\n10. 於大度路一段台2乙線向右轉\n\n11. 靠左以繼續行駛大度路一段台2乙線\n註：繼續開在台2乙線上\n\n12. 靠左繼續走北部濱海公路民權路台2乙線\n\n13. 靠左繼續走北部濱海公路民權路民權路(淡水市區)淡金公路台2乙線台2線\n註：繼續開在北部濱海公路淡金公路台2乙線台2線上\n\n', 'create', 'ChIJxfm16tepQjQRiGuqC_WG578', '開車, 32 分', 25.000035, 121.501401),
(75, '測試六', '臺北市立圖書館北投分館-綠建築示範基地', 1, 1, '1. 往西北走中和路北99鄉道朝廣福路前進\n\n2. 於中山路二段向左轉\n\n3. 於景平路向右轉\n\n4. 接著走華中橋\n\n5. 靠左行駛，進入萬大路\n\n6. 於長泰街向左轉\n\n7. 於東園街向左轉\n\n8. 在第 1 個十字路口向右轉，走萬大路\n\n9. 向右轉，繼續沿萬大路前進\n\n10. 向右轉，朝環河南北快速道路環河快速道路前進\n\n11. 走環河南北快速道路環河快速道路\n\n12. 靠左繼續走環河南北快速道路\n\n13. 靠左繼續走環河北路三段環河南北快速道路\n\n14. 接著走延平北路六段\n\n15. 靠左繼續走延平北路七段\n\n16. 接著走洲美快速道路洲美快速道路(洲美快速道路 承德路北投 淡水)\n', 'create', 'ChIJC1DM2kSuQjQRHQpu_eh59Mg', '開車, 36 分', 25.1365247, 121.5063771),
(76, '測試六', '紅毛城(真理大學)', 1, 2, '路線計算錯誤', 'create', 'ChIJQegHA1ClQjQR80lB63fojRM', 'routeCalculate error', 25.174179, 121.43441),
(77, 'demo', '成田国际机场', 1, 0, '1. 往東南\n\n2. 靠右行駛\n\n3. 在空港西通り４（交差点）處，向右轉\n\n4. 在空港西通り２（交差点）處，向右轉向新空港自動車道\n\n5. 向左轉，走新空港自動車道\n註：收費路段\n\n6. 循著成田料金所的路標走\n註：收費路段\n\n7. 分岔路口靠左，循著東京的路標走然後併入東関東自動車道(湾岸市川~潮来)\n註：收費路段\n\n8. 循著習志野本線料金所的路標走\n註：收費路段\n\n9. 靠右繼續走首都高速湾岸線\n註：收費路段\n\n10. 循著市川料金所的路標走\n註：收費路段\n\n11. 在首都高浦安出口下交流道，朝浦安出口前進\n註：收費路段\n\n12. 走東京湾岸道路国道357号線\n\n13. 在舞浜（交差', '1615632371813455', 'ChIJVze90XnzImARoRp3YqEpbtU', '開車, 51 分', 35.7719867, 140.3928501),
(78, 'demo', '東京迪士尼樂園', 1, 1, '1. 往西\n\n2. 向右轉，朝東海道国道1号線前進\n\n3. 於東海道国道1号線向左轉\n註：繼續開在国道1号線上\n\n4. 沿著宮の下（交差点）直走，到達箱根裏街道国道138号線\n註：繼續開在国道138号線上\n\n5. 在深沢西（交差点）處，靠右行駛到御殿場バイパス国道138号線\n註：繼續開在国道138号線上\n\n6. 向左轉\n\n7. 繼續直行\n\n8. 靠左行駛\n\n9. 繼續直行\n\n10. 繼續直行\n\n11. 向左轉\n\n12. 向右轉，朝県道23号線前進\n\n13. 於県道23号線向右轉\n\n14. 接著走富士山スカイライン県道152号線\n\n15. 向右轉，繼續沿富士山スカイライン県道152号線前進', '1615632371813455', 'ChIJ7-y9RhR9GGARwgKYxSeXAtY', '開車, 1 小時 36 分', 35.635886, 139.878647),
(79, 'demo', '浅草寺', 2, 0, '1. 往西\n\n2. 在とうきょうスカイツリー駅（交差点）處，向右轉向国道6号線\n\n3. 於言問橋東（交差点），接著走国道6号線\n\n4. 沿著言問橋西（交差点）直走，到達言問通り都道319号線\n\n5. 在馬道（交差点）處，向左轉\n\n6. 向右轉', '1615632371813455', 'ChIJx62FmcGOGGARDxQTl8Zx6U4', '開車, 8 分', 35.7150822, 139.7974552),
(80, 'demo', '東京晴空塔', 1, 2, '路線計算錯誤', '1615632371813455', 'ChIJ35ov0dCOGGARKvdDH7NPHX0', '時間計算error唷', 35.71006269999999, 139.8107004),
(81, 'demo', '新宿區', 2, 1, '1. 往西走松原通朝五条坂前進\n\n2. 於五条坂向左轉\n\n3. 在東山五条（交差点）處，靠左行駛，進入東大路通府道143号線\n註：繼續開在府道143号線上\n\n4. 在九条河原町（交差点）處，向左轉，上河原町通国道24号線\n\n5. 沿著河原町十条（交差点）直走\n\n6. 靠右上匝道，朝阪神高速8号京都線走\n註：收費路段\n\n7. 循著鴨川西料金所的路標走然後併入阪神高速8号京都線\n註：收費路段\n\n8. 循著巨椋池本線料金所的路標走\n註：收費路段\n\n9. 在有料道路八幡東ＩＣ出口下交流道，朝京都南道路国道1号線前進\n註：收費路段\n\n10. 循著八幡東料金所的路標走然後併入京都南道路国道1号線\n註：部分', '1615632371813455', 'ChIJS_23WSCNGGAR0u8y4o_GYew', '開車, 1 小時 1 分', 35.6938401, 139.7035494),
(82, 'demo', '澀谷區', 2, 2, '1. 往東\n\n2. 向右轉，朝江戸通り国道6号線前進\n\n3. 在吾妻橋（交差点）處，靠右行駛到江戸通り国道6号線\n\n4. 在駒形橋西詰（交差点）處，向左轉，上都道463号線\n\n5. 於清澄通り都道453号線向右轉\n\n6. 在高速駒形入口（交差点）處，向右轉向首都高速6号向島線\n\n7. 向左轉上匝道，朝首都高速6号向島線前進\n註：收費路段\n\n8. 循著駒形料金所的路標走然後併入首都高速6号向島線\n註：收費路段\n\n9. 靠右行，於江戸橋ＪＣＴ出口下交流道，朝神田橋・北池袋前進\n註：收費路段\n\n10. 走首都高速都心環状線\n註：收費路段\n\n11. 靠右行，於三宅坂ＪＣＴ出口下交流道，朝新宿・中央道前', '1615632371813455', 'ChIJ0Qgx67KMGGARd2ZbObLZHPE', '開車, 30 分', 35.6617773, 139.7040506),
(83, 'demo', '箱根町', 2, 3, '路線計算錯誤', '1615632371813455', 'ChIJe9yyYAyiGWARJnuXrBe9BSY', '時間計算error唷', 35.2323553, 139.1069375),
(84, 'demo', '富士山', 3, 0, '1. 往南朝靖国通り都道4号線前進\n\n2. 在新宿区役所前（交差点）處，向左轉，上靖国通り都道4号線\n\n3. 在新宿五丁目（交差点）處，向右轉到明治通り都道305号線\n\n4. 向左轉\n\n5. 向右轉', '1615632371813455', 'ChIJmcj9QppiGWAR36TzFsn8oaY', '開車, 16 分', 35.3605555, 138.7277777),
(85, 'demo', '清水寺', 3, 1, '1. 往西\n\n2. 向左轉，朝明治通り都道305号線前進\n\n3. 於明治通り都道305号線向左轉\n\n4. 請於玉川通り国道246号線向右急轉\n\n5. 沿著南平台（交差点）直走，到達国道246号線\n\n6. 靠右上匝道，朝首都高速3号渋谷線走\n註：收費路段\n\n7. 循著池尻料金所的路標走然後併入首都高速3号渋谷線\n註：收費路段\n\n8. 靠右繼續走東名高速道路\n註：收費路段\n\n9. 循著東京料金所的路標走\n註：收費路段\n\n10. 在高速厚木ＩＣ出口下交流道，朝小田原厚木道路・厚木出口・平塚・小田原前進\n註：收費路段\n\n11. 循著厚木料金所的路標走\n註：收費路段\n\n12. 分岔路口靠右繼續走高速厚木', '1615632371813455', 'ChIJB_vchdMIAWARujTEUIZlr2I', '開車, 1 小時 10 分', 34.9948561, 135.7850463),
(86, 'demo', '東大寺', 3, 2, '路線計算錯誤', '1615632371813455', 'ChIJ3XYIepA5AWARjzzVnT-skPg', '時間計算error唷', 34.6889851, 135.8398158);

-- --------------------------------------------------------

--
-- 資料表結構 `sharedtrip`
--

CREATE TABLE `sharedtrip` (
  `id` int(11) NOT NULL,
  `tripName` varchar(200) NOT NULL,
  `tripDays` int(11) NOT NULL,
  `tripCountry` varchar(200) NOT NULL,
  `ownerUser` varchar(200) NOT NULL,
  `coverImg` varchar(300) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

--
-- 資料表的匯出資料 `sharedtrip`
--

INSERT INTO `sharedtrip` (`id`, `tripName`, `tripDays`, `tripCountry`, `ownerUser`, `coverImg`) VALUES
(10, '日本五日遊', 5, '日本', 'create', '日本遊.jpeg'),
(11, '香港三日遊', 3, '香港', 'test', '香港.jpeg'),
(12, '峇里島五日遊', 5, '菲律賓', 'create', '峇里島.jpeg'),
(17, '老外玩台北', 3, '台灣', 'create', 'create_老外玩台北_1496669681_tripCover.jpeg'),
(19, '測試二', 1, '台灣', 'create', 'create_測試二_1496854402_tripCover.jpeg'),
(21, '測試四', 1, '台灣', 'create', 'create_測試四_1496855118_tripCover.jpeg'),
(22, '測試五', 1, '台灣', 'create', 'create_測試五_1496855304_tripCover.jpeg'),
(23, '測試六', 1, '台灣', 'create', 'create_測試六_1496857316_tripCover.jpeg'),
(24, 'demo', 3, '日本', '1615632371813455', '1615632371813455_demo_1496901530_tripCover.jpeg');

-- --------------------------------------------------------

--
-- 資料表結構 `sharedtripspot`
--

CREATE TABLE `sharedtripspot` (
  `id` int(11) NOT NULL,
  `tripName` varchar(300) NOT NULL,
  `spotName` varchar(300) NOT NULL,
  `nDay` int(11) NOT NULL,
  `nth` int(11) NOT NULL,
  `trafficToNext` varchar(300) NOT NULL,
  `ownerUser` varchar(300) NOT NULL,
  `placeID` varchar(300) NOT NULL,
  `trafficTitle` varchar(200) NOT NULL,
  `latitude` double NOT NULL,
  `longitude` double NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `sharedtripspot`
--

INSERT INTO `sharedtripspot` (`id`, `tripName`, `spotName`, `nDay`, `nth`, `trafficToNext`, `ownerUser`, `placeID`, `trafficTitle`, `latitude`, `longitude`) VALUES
(5, '日本五日遊', '天龍寺', 2, 1, '', 'create', '', '', 0, 0),
(6, '日本五日遊', '金閣寺', 1, 2, '十號公車轉三號公車，下車向西二十公尺後左轉，五十公尺後右轉，換地鐵三號線至天龍人站，向東行五十公尺後右轉，直行二十公尺', 'create', '', '', 0, 0),
(7, '日本五日遊', '平等院', 2, 2, '十號公車轉三號公車，下車向西二十公尺後左轉，五十公尺後右轉，換五號公車乘坐到金閣寺站，下車向東行三十公尺', 'create', '', '', 0, 0),
(8, '日本五日遊', '清水寺', 1, 1, '十號公車轉三號公車，下車向西二十公尺後左轉，五十公尺後右轉', 'create', '', '', 0, 0),
(36, '老外玩台北', '西門町', 1, 1, '1. 往北走漢中街朝西寧南路71巷前進\n\n2. 於開封街二段向左轉\n\n3. 於環河南路一段向右轉\n\n4. 接著走環河北路一段\n\n5. 向右轉上市民大道匝道，到新生南（北）路永吉路\n\n6. 接著走台北市東西向快速道路市民大道市民大道高架道路\n\n7. 靠右以繼續行駛台北市東西向快速道路市民大道市民大道高架道路\n\n8. 靠左下交流道後，走永吉路\n\n9. 繼續直行，並繼續走永吉路\n\n10. 於松山路向左轉\n\n11. 繼續直行走八德路四段\n\n12. 於饒河街向左轉\n註：16:00 – 00:00 禁止轉彎\n註：目的地在右邊', 'create', '', '走路, 18 分', 0, 0),
(37, '老外玩台北', '松山機場', 1, 0, '1. 往西\n\n2. 靠右，繼續朝敦化北路前進\n\n3. 靠左行駛，進入敦化北路\n\n4. 靠左以繼續行駛敦化北路\n\n5. 靠右繼續走敦化南路一段\n\n6. 於市民大道四段向右轉\n\n7. 接著走市民大道三段\n\n8. 接著走市民大道二段\n\n9. 靠左，繼續朝市民大道一段前進\n\n10. 走市民大道一段\n\n11. 靠左行駛\n\n12. 靠左行駛，進入鄭州路\n\n13. 於延平北路一段向左轉\n\n14. 向右轉，朝忠孝西路二段縱貫公路台1線台3線前進\n\n15. 於忠孝西路二段縱貫公路台1線台3線靠右行駛\n\n16. 於中華路一段台3線向左轉\n\n17. 在第 2 個十字路口向右轉，走開封街二段\n\n18. 於漢中街向左轉', 'create', '', '走路, 19 分', 0, 0),
(38, '老外玩台北', '饒河街觀光夜市', 1, 2, '路線計算錯誤', 'create', '', '時間計算error唷', 0, 0),
(39, '老外玩台北', '故宮博物院', 2, 0, '1. 往南走漢中街朝漢口街二段前進\n\n2. 在第 1 個十字路口向左轉，走漢口街二段\n\n3. 於中華路一段向左轉\n\n4. 於忠孝西路二段縱貫公路台1線台3線向右轉\n註：繼續開在縱貫公路台1線台3線上\n\n5. 繼續直行走忠孝西路一段縱貫公路台1線台3線\n\n6. 靠左行駛，進入忠孝西路一段\n\n7. 於忠孝東路一段台5線向左轉\n\n8. 繼續直行，並繼續走忠孝東路一段台5線\n註：繼續開在台5線上\n\n9. 於八德路一段向左轉\n\n10. 於金山北路向左轉\n\n11. 靠左上匝道接上長安東路民生東路士林大直\n\n12. 走新生高架道路\n\n13. 走中山北路四段台2甲線\n\n14. 繼續直行，並繼續走中山北路四段台', 'create', '', '走路, 25 分', 0, 0),
(40, '老外玩台北', '淡水老街', 2, 1, '路線計算錯誤', 'create', '', '時間計算error唷', 0, 0),
(41, '老外玩台北', '陽明山國家公園', 3, 0, '路線計算錯誤', 'create', '', '時間計算error唷', 0, 0),
(42, '測試二', '新北市中和區中和國民小學', 1, 0, '1. 往東走廣州街朝廣州街209巷前進\n\n2. 於昆明街向左轉\n\n3. 繼續直行，並繼續走昆明街\n\n4. 繼續直行，並繼續走昆明街\n\n5. 於內江街向右轉', 'create', '', '開車, 6 分', 25.000035, 121.501401),
(43, '測試二', '龍山寺', 1, 1, '1. 往西北走中和路北99鄉道朝廣福路前進\n\n2. 於中山路二段向左轉\n\n3. 於景平路向右轉\n\n4. 接著走華中橋\n\n5. 靠左行駛，進入萬大路\n\n6. 接著走康定路\n\n7. 於廣州街向左轉\n註：目的地在右邊', 'create', '', '開車, 16 分', 25.0371623, 121.4999007),
(44, '測試二', '西門紅樓', 1, 2, '1. 往東走內江街朝漢中街前進\n\n2. 於漢中街向右轉\n\n3. 於長沙街二段向左轉\n\n4. 於中華路一段台3線向左轉\n\n5. 靠左以繼續行駛中華路一段台3線\n\n6. 於忠孝西路二段縱貫公路台1線台3線向右轉\n註：繼續開在縱貫公路台1線台3線上\n\n7. 繼續直行走忠孝西路一段縱貫公路台1線台3線\n\n8. 靠左行駛，進入忠孝西路一段\n\n9. 於忠孝東路一段台5線向左轉\n\n10. 繼續直行，並繼續走忠孝東路一段台5線\n註：繼續開在台5線上\n\n11. 於八德路一段向左轉\n\n12. 於金山北路向左轉\n\n13. 靠左上匝道接上長安東路民生東路士林大直\n\n14. 走新生高架道路\n\n15. 走中山北路四段台2', 'create', '', '開車, 26 分', 25.0420139, 121.5068592),
(45, '測試二', '故宮博物院', 1, 3, '1. 往東北走至善路二段\n\n2. 迴轉\n\n3. 繼續直行走至善路一段\n\n4. 於福林路台2甲線向左轉\n\n5. 於中正路靠右行駛\n\n6. 於美德街向右轉\n\n7. 於前街向左轉\n\n8. 於士林橋文林路向右轉\n註：繼續開在文林路上\n\n9. 接著走文林北路\n\n10. 接著走承德路七段台2乙線\n註：繼續開在台2乙線上\n\n11. 靠左繼續走大度路一段台2乙線\n註：繼續開在台2乙線上\n\n12. 靠左繼續走北部濱海公路民權路台2乙線\n\n13. 靠左繼續走北部濱海公路民權路民權路(淡水市區)淡金公路台2乙線台2線\n註：繼續開在北部濱海公路淡金公路台2乙線台2線上\n\n14. 於台2乙線靠右行駛\n\n15. 請於建設', 'create', '', '開車, 44 分', 25.099576, 121.549468),
(46, '測試二', '淡水老街', 1, 4, '路線計算錯誤', 'create', '', 'routeCalculate error', 25.1710272, 121.4385461),
(56, '測試五', '新北市中和區中和國民小學', 1, 0, '1. 往西走光明路朝溫泉路65巷前進\n\n2. 向左轉，繼續沿光明路前進\n\n3. 繼續直行，並繼續走光明路\n\n4. 於中央南路一段向左轉\n\n5. 繼續直行，並繼續走中央南路一段\n\n6. 向右轉，繼續沿中央南路一段前進\n\n7. 向右轉，繼續沿中央南路一段前進\n\n8. 於北投路一段向左轉\n\n9. 於中央南路二段向右轉\n\n10. 於大度路一段台2乙線向右轉\n\n11. 靠左以繼續行駛大度路一段台2乙線\n註：繼續開在台2乙線上\n\n12. 靠左繼續走北部濱海公路民權路台2乙線\n\n13. 靠左繼續走北部濱海公路民權路民權路(淡水市區)淡金公路台2乙線台2線\n註：繼續開在北部濱海公路淡金公路台2乙線台2線上\n\n', 'create', 'ChIJxfm16tepQjQRiGuqC_WG578', '開車, 32 分', 25.000035, 121.501401),
(57, '測試五', '臺北市立圖書館北投分館-綠建築示範基地', 1, 2, '1. 往北走承德路一段\n\n2. 於鄭州路向左轉\n\n3. 於環河北路一段向右轉\n\n4. 走環河南北快速道路\n\n5. 靠左繼續走環河北路三段環河南北快速道路\n\n6. 接著走延平北路六段\n\n7. 靠左繼續走延平北路七段\n\n8. 接著走洲美快速道路洲美快速道路(洲美快速道路 承德路北投 淡水)\n\n9. 下交流道，走大業路，朝北投前進\n註：07:00 – 09:00 部分封閉\n\n10. 繼續直行，並繼續走大業路\n\n11. 繼續直行，並繼續走大業路\n\n12. 於光明路向右轉\n\n13. 向左轉，繼續沿光明路前進\n註：目的地在左邊', 'create', 'ChIJC1DM2kSuQjQRHQpu_eh59Mg', '開車, 25 分', 25.1365247, 121.5063771),
(58, '測試五', '臺北車站', 1, 1, '1. 往西北走中和路北99鄉道朝廣福路前進\n\n2. 於中山路二段向左轉\n\n3. 於景平路向右轉\n\n4. 接著走華中橋\n\n5. 靠左行駛，進入萬大路\n\n6. 於艋舺大道向右轉\n\n7. 繼續直行，並繼續走艋舺大道\n\n8. 接著走中華路二段內山公路台3線\n註：繼續開在台3線上\n\n9. 靠左繼續走中華路一段台3線\n\n10. 於忠孝西路二段縱貫公路台1線台3線向右轉\n註：繼續開在縱貫公路台1線台3線上\n\n11. 繼續直行走忠孝西路一段縱貫公路台1線台3線\n\n12. 於館前路口向左轉\n\n13. 於北平西路向右轉\n\n14. 於承德路一段向左轉\n註：目的地在右邊', 'create', 'ChIJCZEzfnKpQjQRy75KOs4xSsM', '開車, 20 分', 25.0477387, 121.5170396),
(59, '測試五', '紅毛城(真理大學)', 1, 3, '路線計算錯誤', 'create', 'ChIJQegHA1ClQjQR80lB63fojRM', 'routeCalculate error', 25.174179, 121.43441),
(60, '測試六', '新北市中和區中和國民小學', 1, 0, '1. 往西走光明路朝溫泉路65巷前進\n\n2. 向左轉，繼續沿光明路前進\n\n3. 繼續直行，並繼續走光明路\n\n4. 於中央南路一段向左轉\n\n5. 繼續直行，並繼續走中央南路一段\n\n6. 向右轉，繼續沿中央南路一段前進\n\n7. 向右轉，繼續沿中央南路一段前進\n\n8. 於北投路一段向左轉\n\n9. 於中央南路二段向右轉\n\n10. 於大度路一段台2乙線向右轉\n\n11. 靠左以繼續行駛大度路一段台2乙線\n註：繼續開在台2乙線上\n\n12. 靠左繼續走北部濱海公路民權路台2乙線\n\n13. 靠左繼續走北部濱海公路民權路民權路(淡水市區)淡金公路台2乙線台2線\n註：繼續開在北部濱海公路淡金公路台2乙線台2線上\n\n', 'create', 'ChIJxfm16tepQjQRiGuqC_WG578', '開車, 32 分', 25.000035, 121.501401),
(61, '測試六', '臺北市立圖書館北投分館-綠建築示範基地', 1, 1, '1. 往西北走中和路北99鄉道朝廣福路前進\n\n2. 於中山路二段向左轉\n\n3. 於景平路向右轉\n\n4. 接著走華中橋\n\n5. 靠左行駛，進入萬大路\n\n6. 於長泰街向左轉\n\n7. 於東園街向左轉\n\n8. 在第 1 個十字路口向右轉，走萬大路\n\n9. 向右轉，繼續沿萬大路前進\n\n10. 向右轉，朝環河南北快速道路環河快速道路前進\n\n11. 走環河南北快速道路環河快速道路\n\n12. 靠左繼續走環河南北快速道路\n\n13. 靠左繼續走環河北路三段環河南北快速道路\n\n14. 接著走延平北路六段\n\n15. 靠左繼續走延平北路七段\n\n16. 接著走洲美快速道路洲美快速道路(洲美快速道路 承德路北投 淡水)\n', 'create', 'ChIJC1DM2kSuQjQRHQpu_eh59Mg', '開車, 36 分', 25.1365247, 121.5063771),
(62, '測試六', '紅毛城(真理大學)', 1, 2, '路線計算錯誤', 'create', 'ChIJQegHA1ClQjQR80lB63fojRM', 'routeCalculate error', 25.174179, 121.43441),
(63, 'demo', '成田国际机场', 1, 0, '1. 往東南\n\n2. 靠右行駛\n\n3. 在空港西通り４（交差点）處，向右轉\n\n4. 在空港西通り２（交差点）處，向右轉向新空港自動車道\n\n5. 向左轉，走新空港自動車道\n註：收費路段\n\n6. 循著成田料金所的路標走\n註：收費路段\n\n7. 分岔路口靠左，循著東京的路標走然後併入東関東自動車道(湾岸市川~潮来)\n註：收費路段\n\n8. 循著習志野本線料金所的路標走\n註：收費路段\n\n9. 靠右繼續走首都高速湾岸線\n註：收費路段\n\n10. 循著市川料金所的路標走\n註：收費路段\n\n11. 在首都高浦安出口下交流道，朝浦安出口前進\n註：收費路段\n\n12. 走東京湾岸道路国道357号線\n\n13. 在舞浜（交差', '1615632371813455', 'ChIJVze90XnzImARoRp3YqEpbtU', '開車, 51 分', 35.7719867, 140.3928501),
(64, 'demo', '東京迪士尼樂園', 1, 1, '1. 往西\n\n2. 向右轉，朝東海道国道1号線前進\n\n3. 於東海道国道1号線向左轉\n註：繼續開在国道1号線上\n\n4. 沿著宮の下（交差点）直走，到達箱根裏街道国道138号線\n註：繼續開在国道138号線上\n\n5. 在深沢西（交差点）處，靠右行駛到御殿場バイパス国道138号線\n註：繼續開在国道138号線上\n\n6. 向左轉\n\n7. 繼續直行\n\n8. 靠左行駛\n\n9. 繼續直行\n\n10. 繼續直行\n\n11. 向左轉\n\n12. 向右轉，朝県道23号線前進\n\n13. 於県道23号線向右轉\n\n14. 接著走富士山スカイライン県道152号線\n\n15. 向右轉，繼續沿富士山スカイライン県道152号線前進', '1615632371813455', 'ChIJ7-y9RhR9GGARwgKYxSeXAtY', '開車, 1 小時 36 分', 35.635886, 139.878647),
(65, 'demo', '東京晴空塔', 1, 2, '路線計算錯誤', '1615632371813455', 'ChIJ35ov0dCOGGARKvdDH7NPHX0', '時間計算error唷', 35.71006269999999, 139.8107004),
(66, 'demo', '浅草寺', 2, 0, '1. 往西\n\n2. 在とうきょうスカイツリー駅（交差点）處，向右轉向国道6号線\n\n3. 於言問橋東（交差点），接著走国道6号線\n\n4. 沿著言問橋西（交差点）直走，到達言問通り都道319号線\n\n5. 在馬道（交差点）處，向左轉\n\n6. 向右轉', '1615632371813455', 'ChIJx62FmcGOGGARDxQTl8Zx6U4', '開車, 8 分', 35.7150822, 139.7974552),
(67, 'demo', '新宿區', 2, 1, '1. 往西走松原通朝五条坂前進\n\n2. 於五条坂向左轉\n\n3. 在東山五条（交差点）處，靠左行駛，進入東大路通府道143号線\n註：繼續開在府道143号線上\n\n4. 在九条河原町（交差点）處，向左轉，上河原町通国道24号線\n\n5. 沿著河原町十条（交差点）直走\n\n6. 靠右上匝道，朝阪神高速8号京都線走\n註：收費路段\n\n7. 循著鴨川西料金所的路標走然後併入阪神高速8号京都線\n註：收費路段\n\n8. 循著巨椋池本線料金所的路標走\n註：收費路段\n\n9. 在有料道路八幡東ＩＣ出口下交流道，朝京都南道路国道1号線前進\n註：收費路段\n\n10. 循著八幡東料金所的路標走然後併入京都南道路国道1号線\n註：部分', '1615632371813455', 'ChIJS_23WSCNGGAR0u8y4o_GYew', '開車, 1 小時 1 分', 35.6938401, 139.7035494),
(68, 'demo', '澀谷區', 2, 2, '1. 往東\n\n2. 向右轉，朝江戸通り国道6号線前進\n\n3. 在吾妻橋（交差点）處，靠右行駛到江戸通り国道6号線\n\n4. 在駒形橋西詰（交差点）處，向左轉，上都道463号線\n\n5. 於清澄通り都道453号線向右轉\n\n6. 在高速駒形入口（交差点）處，向右轉向首都高速6号向島線\n\n7. 向左轉上匝道，朝首都高速6号向島線前進\n註：收費路段\n\n8. 循著駒形料金所的路標走然後併入首都高速6号向島線\n註：收費路段\n\n9. 靠右行，於江戸橋ＪＣＴ出口下交流道，朝神田橋・北池袋前進\n註：收費路段\n\n10. 走首都高速都心環状線\n註：收費路段\n\n11. 靠右行，於三宅坂ＪＣＴ出口下交流道，朝新宿・中央道前', '1615632371813455', 'ChIJ0Qgx67KMGGARd2ZbObLZHPE', '開車, 30 分', 35.6617773, 139.7040506),
(69, 'demo', '箱根町', 2, 3, '路線計算錯誤', '1615632371813455', 'ChIJe9yyYAyiGWARJnuXrBe9BSY', '時間計算error唷', 35.2323553, 139.1069375),
(70, 'demo', '富士山', 3, 0, '1. 往南朝靖国通り都道4号線前進\n\n2. 在新宿区役所前（交差点）處，向左轉，上靖国通り都道4号線\n\n3. 在新宿五丁目（交差点）處，向右轉到明治通り都道305号線\n\n4. 向左轉\n\n5. 向右轉', '1615632371813455', 'ChIJmcj9QppiGWAR36TzFsn8oaY', '開車, 16 分', 35.3605555, 138.7277777),
(71, 'demo', '清水寺', 3, 1, '1. 往西\n\n2. 向左轉，朝明治通り都道305号線前進\n\n3. 於明治通り都道305号線向左轉\n\n4. 請於玉川通り国道246号線向右急轉\n\n5. 沿著南平台（交差点）直走，到達国道246号線\n\n6. 靠右上匝道，朝首都高速3号渋谷線走\n註：收費路段\n\n7. 循著池尻料金所的路標走然後併入首都高速3号渋谷線\n註：收費路段\n\n8. 靠右繼續走東名高速道路\n註：收費路段\n\n9. 循著東京料金所的路標走\n註：收費路段\n\n10. 在高速厚木ＩＣ出口下交流道，朝小田原厚木道路・厚木出口・平塚・小田原前進\n註：收費路段\n\n11. 循著厚木料金所的路標走\n註：收費路段\n\n12. 分岔路口靠右繼續走高速厚木', '1615632371813455', 'ChIJB_vchdMIAWARujTEUIZlr2I', '開車, 1 小時 10 分', 34.9948561, 135.7850463),
(72, 'demo', '東大寺', 3, 2, '路線計算錯誤', '1615632371813455', 'ChIJ3XYIepA5AWARjzzVnT-skPg', '時間計算error唷', 34.6889851, 135.8398158);

--
-- 已匯出資料表的索引
--

--
-- 資料表索引 `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `pocketspot`
--
ALTER TABLE `pocketspot`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `pockettrip`
--
ALTER TABLE `pockettrip`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `pockettripspot`
--
ALTER TABLE `pockettripspot`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `sharedtrip`
--
ALTER TABLE `sharedtrip`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `sharedtripspot`
--
ALTER TABLE `sharedtripspot`
  ADD PRIMARY KEY (`id`);

--
-- 在匯出的資料表使用 AUTO_INCREMENT
--

--
-- 使用資料表 AUTO_INCREMENT `member`
--
ALTER TABLE `member`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;
--
-- 使用資料表 AUTO_INCREMENT `pocketspot`
--
ALTER TABLE `pocketspot`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;
--
-- 使用資料表 AUTO_INCREMENT `pockettrip`
--
ALTER TABLE `pockettrip`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;
--
-- 使用資料表 AUTO_INCREMENT `pockettripspot`
--
ALTER TABLE `pockettripspot`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=87;
--
-- 使用資料表 AUTO_INCREMENT `sharedtrip`
--
ALTER TABLE `sharedtrip`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;
--
-- 使用資料表 AUTO_INCREMENT `sharedtripspot`
--
ALTER TABLE `sharedtripspot`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=73;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
